#!/usr/bin/env python3
# -*- coding: utf-8 -*-

def f_1(fu):
    print(f"периметр равен = {fu}")
    return 

    
    
if __name__ == '__main__':





#----------------------------------------------------------------------------------

    
    print("Периметр какой фигуры вы хотите узнать, впишите кол-во граней(сторон)")
    a = int(input())
    sps = []
    for i in range(a):
        x = int(input("Введите длинну стороны"))
        sps.append(x)
    
        
#-------------------------------------------------------------------------------------
  
        
    def say(sps):
        k=sum(sps)
        return k
    
        
    #print(say(sps))

    f_1(say(sps))

    
